tutorials/surfaceTracking/bubbleInterTrackFoam/bubble2D_r0.75mm/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="bubbleInterTrackFoam"

runApplication makeFaMesh
runApplication $application
